src/Documents/Радар_Отчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>Радар_Отчет</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Радар_Проверки</xr:Item>
				<xr:Item>InformationRegister.Радар_Ошибки</xr:Item>
				<xr:Item>AccumulationRegister.Радар_Тренд</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/Радар_Тренд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Радар_Тренд</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Модули</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/Радар_Проверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Радар_Проверки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозниклоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбнаружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстИсключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Модули</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/Радар_Отчет/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
	
		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
				
		Посетитель = Обработки.Радар_Посетитель.Создать();
		Посетитель.ПосетитьКонфигурацию(ЭтотОбъект);
		Модули = Посетитель.Модули;
		ГлобальныеСвойства = Посетитель.ГлобальныеСвойства;
		ГлобальныеМетоды = Посетитель.ГлобальныеМетоды;
		Посетитель = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Проект", ЭтотОбъект.Проект);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Радар_ТрендОстатки.Модуль КАК Модуль,
		|	Радар_ТрендОстатки.КоличествоОшибокОстаток КАК КоличествоОшибок
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.Радар_Тренд.Остатки(, Проект = &Проект) КАК Радар_ТрендОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Модуль";
		
		Запрос.Выполнить();
		
		ФайловаяБаза = СтрНайти(СтрокаСоединенияИнформационнойБазы (), "File=") > 0;
		Если ФайловаяБаза Тогда
			Радар_Задания.РазобратьПартиюМодулей(Модули, ЭтотОбъект.Ссылка, ЭтотОбъект.Проект, ГлобальныеСвойства, ГлобальныеМетоды);
		Иначе
			Радар_Задания.РазобратьМодули(Модули, ЭтотОбъект.Ссылка, ЭтотОбъект.Проект, ГлобальныеСвойства, ГлобальныеМетоды);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Радар_Проверки.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Остатки.КоличествоОшибок, 0) < Радар_Проверки.КоличествоОшибок
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Радар_Проверки.Проект КАК Проект,
		|	Радар_Проверки.Модуль КАК Модуль,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Остатки.КоличествоОшибок, 0) < Радар_Проверки.КоличествоОшибок
		|			ТОГДА Радар_Проверки.КоличествоОшибок - ЕСТЬNULL(Остатки.КоличествоОшибок, 0)
		|		ИНАЧЕ ЕСТЬNULL(Остатки.КоличествоОшибок, 0) - Радар_Проверки.КоличествоОшибок
		|	КОНЕЦ КАК КоличествоОшибок
		|ИЗ
		|	РегистрСведений.Радар_Проверки КАК Радар_Проверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО Радар_Проверки.Модуль = Остатки.Модуль
		|ГДЕ
		|	Радар_Проверки.Регистратор = &Регистратор
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.КоличествоОшибок, 0) < Радар_Проверки.КоличествоОшибок
		|				ТОГДА Радар_Проверки.КоличествоОшибок - ЕСТЬNULL(Остатки.КоличествоОшибок, 0)
		|			ИНАЧЕ ЕСТЬNULL(Остатки.КоличествоОшибок, 0) - Радар_Проверки.КоличествоОшибок
		|		КОНЕЦ > 0";
		
		Ошибки = Запрос.Выполнить().Выгрузить();
		
		ЭтотОбъект.Движения.Радар_Тренд.Загрузить(Ошибки);
		ЭтотОбъект.Движения.Радар_Тренд.Записать(Ложь);
		
		Финиш = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		Сообщить(Финиш / 1000);
		
		ОбновитьПовторноИспользуемыеЗначения();
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый");
	КонецЕсли; 
	
КонецПроцедуры
